Title: 写作的好处
Date: 2015-11-07 23:12
Modified: 2015-11-07 23:22
Category: Life
Tags: 生活,写字
Slug: the-benifit-of-writing
Authors: Poon
Summary:

自开博以来，已经陆陆续续写了几篇博客了。而且有种越写越起劲的感觉，希望不是新鲜感作祟。写博这几天来，我发现了写字有几个好处：

1. 写作促进思考
2. 写作的机会成本低：没空干坏事了
3. 形成自己的风格
4. 提高写作水平
5. 鞭策自己学习
6. 释放想象力

此话怎讲？且听我细细道来：

大家都知道，现实生活中，有很多事情是只能意会，不可言传的。而当我们打算把意会的东西一字一句地写下来的时候，就有讲究了。你一讲究，想法就出来了;想法一出来，你就把他写下，那么文章就成了！
以上都是我瞎说的。我真正要说的是：写文章的人，都有一个共同点：表达自己。既然要表达自己，就要把话说清楚。要把话说清楚，就要构思，就要组织语言，组织语言的结果，就是要让大家都看得懂你说什么，看得懂不单止是语句通顺，更重要的是表意清晰。表意清晰的前提是，你首先要知道自己想说什么，然后再把话说清楚。

