Title: 疯狂外星人比小黄人大眼萌好看，不服来辩
Date: 2015-11-08 12:47
Modified: 2015-11-10 09:03
Category: Life
Tags: film,talk
Slug: the-film-home-is-better-than-the-minion-in-2015
Authors: Poon
Summary: 疯狂外星人比小黄人大眼萌好看，不服来辩

我承认，小黄人是比疯狂外星人好笑，但是我还是打给疯狂外星人的综合评分高于小黄人。

小黄人之所以好笑，是因为抓住了：无厘头、贱这两个词。无厘头，其实就是平静湖面中投入的一块石头,鸡圈里扔进一只黄鼠狼，一个因为生活把自己的生日都忘了的人，突然收到别人准备的生日礼物所带来的惊喜。无厘头的精粹，在于把空虚寂寞、平淡无奇、循规蹈矩的状态打破，通过制造出人意料的、在日常生活中人们不敢去做的小事，来博取观众的猎奇心理和满足感。

# 小黄人

## 无厘头

为什么人们喜欢无厘头的东西？因为首先这些事情大家都遇到过，但从来没有用像电影那样的态度去对待，而电影的夸张表达，立即抓住了大家的猎奇心理，然后会说：不会吧，这也行？
其实无厘头就是，明知是为了搞笑而搞笑，但我还是笑了。

## 贱

相信很多人喜欢小黄人，也是因为小黄人骨子里有一种贱贱的性格。俗话说，物以稀为贵。贱，其实也是一种很稀有的品格。所以大家都喜欢。此话怎讲？

因为我们大部分人都活在社会这个牢笼当中，大部分人都是循规蹈矩的，而大部分人，都有一种摆脱束缚的渴望。而‘贱’这件事本身，就暗含了一种‘我可以自由地做我想做的事情，甚至是坏事‘这样的一种精神在这里。所以，我们其实是喜欢一种自由的精神。 同时，贱不等于坏。贱是一种只做小恶，不做大恶的态度，所以它不会被人作为众矢之的。反而给平淡的生活添加了不少乐趣。最后，当有人被贱到了，大家就有热闹可以看了，人都喜欢看热闹，不是吗？

# 疯狂外星人

## 逗比

欧，一个逗比外星人，有着天真的心，不懂人情事故，但他忠于自己的内心。加上笨拙的手脚，以至于常常闹出笑话，并使得大家都不怎么喜欢它。但是观众喜欢啊！因为他逗比，逗比，逗比。你看他一出场，就把人撂倒一大片！犯3次错就会被人排挤，而他却犯了63次！在他身上，固执、迟钝等都成了优点！

## 感情牌

全片穿插了几种感情：人类和波波星人的感情，人与动物的感情，母女情。这其实是一部不同物种之间应该如何相处的电影。
正是这张感情牌,把电影的高度提升了。所以，打分比小黄人高！

本文最后更新于: 2015-11-10 09:31
