工作中如何让自己无可替代？

根据香港讨论区（discuss.com.hk）的贴子说法，在英文名和人物特征的关联关系里： Andy、Kevin、David、Raymond=普通中佬 。那么我就选David来说事吧。如有雷同，请对号入座，哈哈😄。

David 在某IT公司上班，今年刚刚三十。基层员工。所以也算是普通中佬了。David猛然醒起，自己已经二够奔三了，不再年轻了。人到三十，于是也开始考虑自己的前（后）途（路）问题。

他目前担心几个问题：

1.  自己的收入能否持续并每年得到提升。
2.  自己的岗位与工作收入是否会被新人取代。
3.  自己是否有足够的竞争力不被日新月异的技术发展所淘汰。
4.  如果失业了，还能干点什么？

由于David目前的思绪比较混乱，比较迷茫，所以上面4点没有什么逻辑和递进关系，所以请各位看官见谅😄。

其实以上的几个问题，都可以归结为，如果我离开了目前的工作，还能否继续生活，继续还房贷，还信用卡，每个月去几次星巴克，上几次馆子，每年再去两三次旅游...blah blah blah...

收入的来源有很多种，但是每种收入都是要付出时间作为代价的。可以上班赚钱，可以创业做生意赚钱，甚至还可以打家劫舍去赚钱，但都是要付出时间成本的。有钱人和穷人的区别是，单位时间内赚钱的速度。很明显，抢银行是来钱最块的，但是风险也特别大。创业也可以赚钱，风险次之，因为收入不稳定，而且前期很可能处于一致亏本的状态。对于David这种有贷款在身的人，目前是不太适宜创业的，当然也不能去打劫银行啦😄。所以，他只能继续打工，上班，打工，上班。

那么问题就变得简单多了，那就是，怎么才能不失业，甚至让自己的能够持续收入，抵抗通胀，甚至能稳步上升呢？最最最坏的情况，也至少是不被人抢饭吧。

其实David心里清楚，没有什么工作是无可替代的。纵观世上，有哪份工作是人走了就无法继续了的呢？谁辞职了，留下的工作都会有人接替。只是，作为企业，考虑稳定性和风险，不会轻易开除一名已经在岗多年的员工。但是，如果企业正面临生死存亡，就另当别论了。国内外知名企业，都存在裁员事件：IBM，微软，HP等等...所以，这个问题，还是有必要考虑的。至少，他要让自己与别人相比，没那么容易失业。或者说，就算失业了，还能找到第二份薪水相当的工作。而这些问题，在他二十来岁、不用养家糊口的时候，是从来不关心的。

于是他开始审视自己的工作，是否有存在丢饭碗的风险：

1. 工作是否能够简单重复
2. 工作是否需要较多的知识储备；工作门槛是否够高
3. 工作本身是否具有成长性
4. 工作每天是否会带给自己负面情绪


他发现，其实工作中的每个任务表面上看起来都不太一样，但其实都是用类似的方法、工具、技术来处理。偶尔会有一些超出他知识范围的问题出现，但是基本上他都能通过google解决。在他认为，其实有80％的工作，通过训练，一个普通大专以上的实习生，都能应付，只是可能效率不高而已。

David发现他手上的工作也比较杂，不同的工作，需要用到不同的知识，比如：
*  生成一份report需要懂得：sql , java , reporting tools
* 维护系统正常运行，需要了解linux ，需要了解系统特有的环境，软件本身的设计和工作原理，以及软件调试。
* 处理数据异常，需要能读懂计算逻辑,了解计算口径，知道数据在业务上代表什么。
* 沟通需求：需要知道业务人员说的是什么，如何应对，当何解决。

这些知识，是需要有一定经验积累才能处理的。但是对于一个正常的一个普通的大专以上毕业生，需要多长时间的积累才能胜任呢？根据他的观察，可能要3－5年吧。比较聪明同时又比较善于利用时间的人，可能2年也可以。而David是一个已经工作了7，8年了的人，如果仍继续这样的工作，显然是很容易被工作3-5年的人替代的。所以，David需要进入更深层次的工作：更深入地了解业务，学习更深层次的技术，比如DM等。

就目前的工作而言，很多技术是应用，是需要业务需要来推动的。如果没有业务需求，那么，David在 80%的情况下，会疏于了解。因为平时工作生活中，有太多无关重要的事情，在分散他的时间和精力。使得他不能好好深入地学习一门技术，深入了解一个产品的全部功能。他也萌生过专注于一个产品，熟悉他所有其他更新的、更强大的功能的想法，但是都由于种种原因，未能付诸行动。总而言之，在工作上，带给他的事业成长是比较有限的，唯一能让他快速成长的，还是需要他本人内在的动力，当有更强的动机时，后者陷入更深的危机中，可能就是他成长最快的时候。

至于工作状态，David目前处于还能忍受的状态。一般能让David产生负面情绪的，主要是超出职责范围内的工作安排，总的来说是薪酬、职责、工作量的平衡。David是比较注重工作方法的人，不怕难，就怕繁。当然，就算是纷繁的工作，David也是有办法将之化繁为简的。另外，对工作是否满意，除了薪酬、工作量之外，还有工作地点，工作时长等。网上流传一句话：钱多事少离家近，是大多数人比较理想的工作状态。其实，根据David考量问题的时间法则，就是：单位时间内的赚钱效率高、留给自己的时间多、花在照顾家庭的时间少。

经过上面对这几个问题的审视，David发现其实自己在目前的岗位上的优势已经不多，他需要学习更多的业务知识和更深入的技术知识。

说了这个多，其实都是为了获得更好的收入。那么David是否还有别的渠道创收呢？说没有是假的，但是赚钱方法有千百万种，哪种才最适合David呢？David是搞IT的，每天都是跟虚拟的事物打交道，看得见，摸不着。有市场的地方就有交易，有交易的地方就有钱赚，而对于David来说，他更适合哪个市场呢？不是菜市场？不是人才市场，不是二手市场，不是电子市场，而是资本市场。不是资本市场有多高大。
